import { atom } from "recoil"


export const FeedAtom = atom({
    key:'category_key',//전역적으로 유일한 값
    default:[
        { 
            id : 1,
            Ctitle : "top",
            arr : [
            "맨투맨",
            "셔츠/블라우스",
            "후드티",
            "니트/스웨터",
            "반팔티",
            "카라티",
            "긴팔티",
            "민소매",
            "스포츠",
            "기타 상의"
        ]},
        { 
            id : 2,
            Ctitle : "outer",
            arr : [
            "후드 집업",
            "가디건",
            "베스트",
            "플리스",
            "아노락",
            "블루종",
            "라이더 자켓",
            "트러커 자켓",
            "무스탕",
            "블레이저",
            "싱글 코트",
            "더블 코트",
            "더플 코트",
            "롱패딩",
            "숏패딩",
            "기타"
        ]},
        { 
            id : 3,
            Ctitle : "pants",
            arr : [
            "데님 팬츠",
            "코튼 팬츠",
            "슬랙스",
            "트레이닝 팬츠",
            "조거 팬츠",
            "숏 팬츠",
            "레깅스",
            "점프 슈트",
            "스포츠 하의",
            "기타"
        ]},
        {
            id : 4,
            Ctitle : "shoes",
            arr : [
            "스니커즈",
            "컨버스",
            "워커",
            "로퍼",
            "보트화",
            "슬립온",
            "운동화",
            "구두",
            "부츠",
            "플랫 슈즈",
            "블로퍼",
            "샌들",
            "슬리퍼",
            "기타"
        ]},
        {
            id : 5,
            Ctitle : 'back',
            arr : [
            "백팩",
            "메신저백",
            "크로스백",
            "숄더백",
            "토트백",
            "에코백",
            "더플백",
            "클러치백",
            "이스트백",
            "기타"
        ]},
        {
            id : 6,
            Ctitle : "hat",
            arr : [
            "베레모",
            "페도라",
            "버킷/사파리햇",
            "비니",
            "트루퍼",
            "기타"
        ]},
    ]
});